Tekla Open API Reference for Tekla Structures 2025
PluginFormBase Methods
The PluginFormBase type exposes the following members.
Methods
Name | Description
ApplyValues
 Loads the dialog values from a file and performs Apply() on the loaded values. To match the files to a certain dialog, the file suffix is set as the dialog type's name.
 (Inherited from FormBase.)
Get
 Gets the dialog values from the part that is currently selected in Tekla Structures.
GetConnectionStatus
 Returns true if a proper connection to the Tekla Structures process has been established. Currently, there's no way to re-establish the connection.
 (Inherited from FormBase.)
InitializeForm
 Prepares the data storage for the dialog and scans through the fields.
 (Inherited from FormBase.)
LoadValues
 Loads the dialog values from a file. To match the files to a certain dialog, the file suffix is set as the dialog type's name.
 (Inherited from FormBase.)
ModifyValues
 Loads the dialog values from a file and performs Modify() on the loaded values. To match the files to a certain dialog, the file suffix is set as the dialog type's name.
 (Inherited from FormBase.)
ReloadForm
 Reloads the dialog values.
SaveValues
 Serializes the dialog values to an xml file.
 (Inherited from FormBase.)
SetAttributeValue
 Sets a value for the given control. When the dialog is not shown, setting a property directly for a control (such as textBox1.Text = "text") will not work for controls that have a Tekla Structures AttributeTypeName set. This method is going to have to be used to set the value.
 (Inherited from FormBase.)
ShowForm
 Displays the form.
 (Inherited from FormBase.)
UpdateValues |  Obsolete.
 Rereads and updates all the field values on the form.
 (Inherited from FormBase.)
Top
See Also
Reference
PluginFormBase Class
Tekla.Structures.Dialog Namespace